class EmailString:
    PREMODERATION_REJECTED = """
Ваша инициатива {}, «{}» отклонена по результатам предварительной модерации.

Для просмотра подробной информации перейдите в личный кабинет https://24ag.ru/. 

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/"""

    PREMODERATION_ACCEPTED = """
Ваша инициатива {}, "{}" прошла предварительную модерацию и направлена на проведение экспертной оценки. 

Для просмотра подробной информации перейдите в личный кабинет 24ag.ru

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/
"""

    MODERATOR_OFFERED_CHANGES = """
При проведении предварительной модерации Вашей инициативы {}, "{}" Модератором были внесены изменения. \
Для согласования внесенных изменений перейдите в личный кабинет 24ag.ru"""

    PREMODERATION_ACCEPTED_OPERATOR = """
Здравствуйте!
На цифровой платформе «Активный гражданин» размещена новая инициатива «{}, "{}"».
Пожалуйста, авторизуйтесь на портале https://24ag.ru/ с помощью учетной записи Госуслуг. Перейдите в личный кабинет и проверьте инициативу на корректность. Согласуйте инициативу для сбора голосов или отклоните ее с указанием причины.
Инструкция по работе с разделом инициативы: https://disk.yandex.ru/i/WUPG7huDR1CgEQ.

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/
"""

    PREMODERATION_INITIATIVE_CREATED = """
Здравствуйте!
На цифровой платформе «Активный гражданин» размещена новая инициатива «{}, "{}"».
Пожалуйста, авторизуйтесь на портале https://24ag.ru/ с помощью учетной записи Госуслуг. Перейдите в личный кабинет и проверьте инициативу на корректность: соответствие тематической категории и подкатегории; 
грамматические, лексические и пунктуационные ошибки. 
Отредактируйте, согласуйте или отклоните инициативу.

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/
"""

    MODERATION_REJECTED = """
Ваша инициатива {}, «{}» отклонена по результатам экспертной оценки.

Для просмотра подробной информации перейдите в личный кабинет https://24ag.ru/. 

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/
"""

    MODERATION_APPROVED = """
Ваша инициатива {}, «{}» прошла предварительную экспертную оценку и доступна для сбора голосов в ее поддержку. 

Для просмотра подробной информации перейдите по ссылке 24ag.ru

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/
"""

    MODERATION_APPROVED_TO_MODERATOR = """
Здравствуйте!
Информируем Вас, о публикации на цифровой платформе «Активный гражданин» https://24ag.ru новой инициативы «{}, "{}"».

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/
"""

    MODERATION_REJECTED_TO_MODERATOR = """
Здравствуйте!
Информируем Вас о том, что на цифровой платформе «Активный гражданин» https://24ag.ru отклонена инициатива «{}, "{}"».

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/
"""

    DECISION_PUBLISHED = """По результатам рассмотрения Вашей инициативы \
{}, "{}" опубликовано решение. Для просмотра подробной информации перейдите по ссылке 24ag.ru"""

    ACCOMPLISHED = """По результатам реализации Вашей инициативы \
{}, "{}"  опубликован отчет. Для просмотра подробной информации перейдите по ссылке 24ag.ru"""

    ADDITIONAL_INFO_REQUEST_MODERATOR = """При проведении предварительной \
модерации Вашей инициативы {}, "{}" Модератором направлен запрос для получения \
дополнительной информации. Для ответа на запрос перейдите в личный кабинет 24ag.ru"""

    ADDITIONAL_INFO_RESPONSE = """Получен ответ на запрос по инициативе {}, "{}". \
Для просмотра подробной информации перейдите в личный кабинет 24ag.ru"""

    ADDITIONAL_INFO_REQUEST_OPERATOR = """При проведении предварительной экспертной оценки \
Вашей инициативы {}, "{}" был направлен запрос для получения дополнительной информации. \
Для ответа на запрос перейдите в личный кабинет 24ag.ru"""

    NECESSARY_VOTES_COLLECTED = """Голосование в поддержку Вашей инициативы \
{}, "{}" завершено. Инициатива набрала необходимое количество голосов и направлена на рассмотрение. \
Для просмотра подробной информации перейдите по ссылке 24ag.ru"""

    TIME_EXCEEDED = """Голосование в поддержку Вашей инициативы {}, "{}" завершено. \
Инициатива не набрала необходимое количество голосов Для просмотра \
подробной информации перейдите по ссылке 24ag.ru"""

    MODERATOR_APPROVE_ANSWER = """Ответ на запрос по Вашей инициативе {}, "{}" прошел модерацию и направлен на рассмотрение. \
Для просмотра подробной информации перейдите в личный кабинет 24ag.ru"""

    MODERATOR_REJECT_ANSWER = """Ответ на запрос по Вашей инициативе {}, "{}" отклонен по результатам модерации. \
Для просмотра подробной информации перейдите в личный кабинет 24ag.ru"""

    PLAN_COMMENT_CREATED = """
Здравствуйте!
Информируем Вас, о публикации нового комментария под планом: "{} [{}]" на цифровой платформе «Активный гражданин» https://24ag.ru».

С уважением, 
Цифровая платформа «Активный гражданин»
https://24ag.ru/
"""
