class NotifyText:
    PREMODERATION_APPROVED = "Инициатива прошла предварительную модерацию и направлена на проведение предварительной экспертной оценки."
    PREMODERATION_REJECTED = (
        "Инициатива отклонена по результатам предварительной модерации."
    )
    MODERATION_APPROVED = "Инициатива прошла предварительную экспертную оценку и доступна для сбора голосов в ее поддержку"
    NECESSARY_VOTES_COLLECTED = "Инициатива набрала необходимое количество голосов и направлена на рассмотрение."
    TIME_EXCEEDED = "Инициатива не набрала необходимое количество голосов."
    MODERATOR_OFFER_CHANGES = "При рассмотрении Вашей инициативы на этапе предварительной модерации были внесены изменения. \
Для направления инициативы органу власти, ответственному за проведение предварительной экспертной оценки, необходимо согласовать изменения"
    USER_ACCEPT_CHANGES = "Заявитель инициативы подтвердил изменения модератора"
    USER_REJECT_CHANGES = "Заявитель инициативы отклонил изменения модератора"
