Repository: pypi-data/pypi-mirror-242
Catalog: packages/collective.tileindex/collective.tileindex-1.0.0a2.tar.gz/collective.tileindex-1.0.0a2/src/collective/tileindex/locales/*/LC_MESSAGES/collective.tileindex.po
Languages: nl

source: ERROR: tile_types index is missing!
nl: FOUT: tile_types index niet gevonden!

source: Installs the collective.tileindex add-on.
nl: Installeert collective.tileindex

source: Private/Other ${unpublished}
nl: Privé/anders

source: Published ${published}
nl: Gepubliceerd

source: Search results for tile ${tile} ${published}/${unpublished} (published/unpublished)
nl: Zoekresultaten voor tegel ${tile} - ${published}/${unpublished} (gepubliceerd/privé)

source: Tile names sorted alphabetically
nl: Tegelnamen alfabetisch gesorteerd

source: Tile names sorted by number of items that use it
nl: Tegelnamen gesorteerd naar aantal items dat er gebruik van maakt.

source: Tile types overview
nl: Tegeltypes overzicht

source: Tile types used on this page
nl: Tegeltypes gebruikt op deze pagina

source: Uninstalls the collective.tileindex add-on.
nl: Deactiveert collective.tileindex

source: msg_note_same_type_counted_once
nl: N.B. Een pagina met 100 tegels van hezelfde type, wordt slechs één keer meegeteld.

source: msg_num_objects
nl: Er zijn ${numObjects} items met tegels in de index.
